app/Helpers/Catalogos_helper.php

function getDatosEmpleadoEspecifico($numempleado)
{
    $db = \Config\Database::connect();
    $usermode = new Empleados_model($db);
    $usermode->select('nombre,id_rol');
    $usermode->where('numempleado',$numempleado);
    $resultado = $usermode->get();
---
SELECT `nombre`, `id_rol`
FROM `empleados`
WHERE `numempleado` = '800'