app/Controllers/Empleados.php

INSERT INTO `empleados` (`numempleado`, `nombre`, `apellidoPaterno`, `apellidoMaterno`, `id_rol`, `fecha_creacion`, `fecha_ultimo_cambio`) VALUES ('1300', 'HUmberto', 'Flores', 'De la Cruz', '1', '2023-05-11 05:57:09', '2023-05-11 05:57:09')
---
    public function insertarEmpleado()
	{

        if(isset($_POST['submitaddempleado'])){

            $REQUEST = \Config\Services::request();
            $hoy = date("Y-m-d H:i:s");

            $data = ['numempleado' =>$REQUEST->getPost('num_empleado'),
                'nombre' =>$REQUEST->getPost('nombre'),
            'apellidoPaterno' =>$REQUEST->getPost('apellidoPaterno'),
            'apellidoMaterno' =>$REQUEST->getPost('apellidoMaterno'),
            'id_rol' =>$REQUEST->getPost('rol'),
            'fecha_creacion' =>$hoy,
            'fecha_ultimo_cambio' =>$hoy
            ];

            $empleadomodel = new Empleados_model($this->db);
            try {
                $empleadomodel->insert($data);