app/Controllers/Movimientos.php

    public function insertarMovimiento()
	{

        if(isset($_POST['submitaddmovimiento'])){

            $REQUEST = \Config\Services::request();
            $hoy = date("Y-m-d H:i:s");

            $data = ['numempleado' =>$REQUEST->getPost('numempleado'),
                'nombre' =>$REQUEST->getPost('nombre'),
            'id_rol' =>$REQUEST->getPost('rol'),
            'mes' =>$REQUEST->getPost('mes'),
            'num_entregas' =>$REQUEST->getPost('num_entregas'),
            'fecha_creacion' =>$hoy,
            'fecha_ultimo_cambio' =>$hoy
            ];

            $empleadomodel = new Movimientos_model($this->db);
            try {
                $empleadomodel->insert($data);
---
INSERT INTO `movimientos` (`numempleado`, `nombre`, `id_rol`, `mes`, `num_entregas`, `fecha_creacion`, `fecha_ultimo_cambio`) VALUES ('300', 'Alejandro', '3', '11', '5', '2023-05-12 04:22:23', '2023-05-12 04:22:23')